Repository: Rasbats/calculator_pi
Catalog: po/*.po
Languages: fr_fr, sv_se

source: Humidex is an index to indicate how hot or humid the weather feels to the average person. It is derived by combining temperature and humidity values into one number to reflect the perceived temperature. For example, a humidex of 40 means that the sensation of heat when the temperature is 30 degrees and the air is humid feels more or less the same as when the temperature is 40 degrees and the air is dry.
fr_fr: Humidex est un indice qui indique à quel point le climat est chaud ou humide. Il est obtenu en combinant les valeurs de température et d'humidité en un seul chiffre afin de refléter la température perçue. Par exemple, un humidex de 40 signifie que la sensation de chaleur lorsque la température est de 30 degrés et l'air humide est plus ou moins la même sensation que lorsque la température est de 40 degrés et que l'air est sec.

source: Beaufort to Wind Velocity
fr_fr: Equiv : Vitesse du vent ---> Beaufort

source: Beaufort scale was created in 1805 by Sir Francis Beaufort, British admiral and hydrographer. It describes wind speed based mainly on observed sea conditions.
fr_fr: L'échelle de Beaufort a été créée en 1805 par Sir Francis Beaufort, amiral britannique et hydrographe. Elle définit la vitesse du vent en se basant principalement sur les conditions de mer observées.

source: Wind Velocity to Beaufort
fr_fr: Equiv : Vitesse du vent ---> Beaufort

source: Pressure at depth
fr_fr: Pression en profondeur

source: If a fluid is within a container then the depth of an object placed in that fluid can be measured. The deeper the object is placed in the fluid, the more pressure it experiences. This is because is the weight of the fluid above it. The more dense the fluid above it, the more pressure is exerted on the object that is submerged, due to the weight of the fluid. Density is function of salinity and water temperature. Below are average values. Density Sea Water = 1.035 kg/liter Density Fresh Water = 1.0 kg/liter
fr_fr: Si un fluide se trouve dans un récipient, la profondeur d'un objet placé dans ce fluide peut être mesurée. Plus l'objet est placé profondément dans le fluide, plus il subit une pression. Ceci est dû au poids du fluide au dessus de lui. Plus le fluide au-dessus de lui est dense, plus la pression exercée sur l'objet immergé est importante en raison du poids du fluide. La densité est fonction de la salinité et de la température de l'eau. Ci-dessous, les valeurs moyennes : Densité eau de mer = 1.035 kg / litre Densité eau douce = 1.0 kg / litre

source: Diving
fr_fr: Plongée

source: Distance to horizon
fr_fr: Distance à l'horizon

source: If the Earth is assumed to be a sphere with no atmosphere then the distance to the horizon can easily be calculated. (The Earths radius of curvature actually varies between the Equator and the Poles, so this formula isnt absolutely exact even assuming no refraction.) This formula assumes earth diameter of 12756.32 km.
fr_fr: Si on suppose que la Terre est une sphère sans atmosphère, alors la distance à l'horizon peut être facilement calculé. (Le rayon courbure de la Terre varie entre l'Équateur et les pôles, donc la formule n'est pas tout à fait exacte, même sans tenir compte de la réfraction) ; Cette formule suppose un diamètre terrestre de 12756,32 km.

source: Objects above horizon
fr_fr: Objets au-dessus de l'horizon

source: To compute the greatest distance at which an observer can see the top of an object above the horizon, compute the distance to the horizon for a hypothetical observer on top of that object, and add it to the real observers distance to the horizon. This formula assumes earth diameter of 12 756.32 km.
fr_fr: Pour calculer la plus grande distance à laquelle un observateur peut voir le sommet d'un objet au-dessus de l'horizon, calculez la distance à l'horizon pour un observateur hypothétique au-dessus de cet objet et ajoutez-la à la distance réelle des observateurs à l'horizon. Cette formule suppose un diamètre de terre de 12 756,32 km.

source: Convert Distance
fr_fr: Convertir la distance

source: Convert Temperature
fr_fr: Convertir la température

source: Convert Speed
fr_fr: Convertir la vitesse

source: Convert Pressure
fr_fr: Convertir la pression

source: Convert Angle
fr_fr: Convertir l'angle

source: Convert Flowrate
fr_fr: Convertir le débit

source: Convert Degrees (All formats)
fr_fr: Convertir les degrés (Tout formats)

source: Convert (All formats)
fr_fr: Convertir (Tout formats)

source: Symbolic Calculator Plugin
sv_se: Symbolisk kalkylatormodul

source: This is a calculator & mathematical expression parsing plugin. Would you like to know your hull speed?
sv_se: Detta är en plugin för kalkyl och matematisk analys. Vill du vill veta din skrovhastighet?

source: Calculator by SaltyPaws
sv_se: Kalkylatorn av SaltyPaws

source: Calculator output:
sv_se: Kalkylatorns utdata:

source: Use up and down keys, while cursor is in input box, to recall previous input and results. Examples of expression that work in the calculator are: (comments are in brackets, some results depend on other example calculations): ========= Hull speed: LWL=48 (water line lenght in feet) vhull=1.34*LWL^(1/2) (hull speed in knots) Conversions: ftm=0.3048 (feet to meters) km_to_nm=0.539957 (Kilometers to nautical Mile) ftm*LWL (waterline length in meters) Distance to horizon R=6378.1*1000 (Radius of the earth in m) H=2.5 (Height of the eye above sea-level in m) d = R * acos(R/(R + h)) (Distance to horizon in m) ans*km_to_nm (Distance to horizon in nm) Distance to lighthouse H1=200 (height of lighthouse in m) d1 = R*acos(R/(R + H1))(Distance to horizon in m) distance=d1+d (visibility range of lighthouse in m) Operators: & | << >> = <> < > <= >= + - * / % || ^ (NB use ^(1/2) for square root) ! (Factorial) Functions: Abs, Exp, Sign, Sqrt, Log, Log10 Sin, Cos, Tan, ASin, ACos, Atan (default entry is in radians use e.g. sin(dtr*90) to calculate in degree) Factorial Variables: Pi, e dtr is the conversion factor from degrees to radians Ans is the result of the previous calulation you can define your own variables (e.g. myvariable=10/8*cos(dtr*90) or yourvariable=Ans)
sv_se: När pekaren är i inmatningsfältet kan upp/ned-pilarna användas för att växla till tidigare data och resultat Följande är exempel på beräkningar som fungerar. (Kommentarer inom parentes. Vissa beräkningar är beroende av tidigare exempel): ========= Fart: LWL=48 (vattenlinjen i fot) vhull=1.34*LWL^(1/2) (fart i knop) Konverteringar: ftm=0.3048 (fot till meters km_to_nm=0.539957 (Kilometer till nautisk mil) ftm*LWL (vattenlinjelängd i meter) Avstånd till horisonten R=6378.1*1000 (Jordradien i m) H=2.5 (Ögats höjd över vattenytan i m) d = R * acos(R/(R + h)) (Avstånd till horisonten i m) ans*km_to_nm (Avstånd till horisonten i NM) Avstånd till fyr H1=200 (Fyrhöjd i m) d1 = R*acos(R/(R + H1))(Avstånd till horisonten i m) distance=d1+d (Fyrljusräckvidd i m) Operators: & | << >> = <> < > <= >= + - * / % || ^ (NB; använd ^(1/2) for kvadratrot) ! (Faktorer) Funktioner: Abs, Exp, Sign, Sqrt, Log, Log10 Sin, Cos, Tan, ASin, ACos, Atan (Angett som radianer. Använd ex.vis. sin(dtr*90) för att räkna i grader) Faktorer Variabler: Pi, e dtr är konverteringsfaktor från grader till radianer Ans är resultatet från tidigare beräkning Du kan definiera egna variabler (t.ex. minVar=10/8*cos(dtr*90) eller egenVar=Ans)

source: General settings
sv_se: Allmänna inställningar
