Repository: Rasbats/calculator_pi
Catalog: po/*.po
Languages: fr_fr, sv_se

source: calculator
fr_fr: calculette

source: Calculator
fr_fr: Calculette
sv_se: Kalkylatorn

source: Calculator Plugin
fr_fr: Complément Calculette

source: This is a light weight yet powerful calculator plugin for OpenCPN. Would you like to know your hull speed?
fr_fr: C'est un complément léger mais capable de calculs performants pour OpenCPN. Par exemple : Voulez vous connaître la vitesse de votre coque ?

source: Calculator Preferences
fr_fr: Préférences
sv_se: Kalkylator-inställningar

source: Calculator preferences
fr_fr: Préférences
sv_se: Kalkylatorinställningar

source: Help!!!!
fr_fr: Aide !!!!

source: Degree Conversions
fr_fr: Conversions des degrés

source: Extra Functions
fr_fr: Fonctions supplémentaires

source: All
fr_fr: Tout

source: LWL = Length of water line Vhull = Hull speed
fr_fr: LWL = Longueur de flottaison Vhull = Vitesse de coque

source: fetch = distance over water that the wind blows
fr_fr: fetch = Distance sur l'eau parcourue par le vent

source: fetch = distance over water that the wind blows U10 - windspeed (10m) must be entered as m/s
fr_fr: fetch = Distance parcourue sur l'eau par le vent U10 est la vitesse du vent (à 10m) et doit être en m/s

source: Height_observer is the height of the observer Height_object is the height of the object
fr_fr: Height_observer est la hauteur de l'observateur Height_object est la hauteur de l'objet

source: Mouse
fr_fr: Souris

source: List
fr_fr: Liste

source: Error
fr_fr: Erreur
sv_se: Fel

source: Error:Missing parenthesis
fr_fr: Erreur : Parenthèse manquante

source: Calculator INPUT:
fr_fr: Entrées des données :

source: Calculator output:
fr_fr: Sortie des données :

source: Calculate
fr_fr: Calculer
sv_se: Beräkna

source: Function
fr_fr: Fonction

source: History
fr_fr: Historique

source: Help
fr_fr: Aide
sv_se: Hjälp

source: Display Accuracy
fr_fr: Précision d'affichage

source: Three decimal places (Default)
fr_fr: Trois décimales (Par défaut)

source: Precise
fr_fr: Précis

source: Precise, thousands separator
fr_fr: Précis, séparateur de milliers

source: Succinct, thousands separator
fr_fr: Succinct, séparateur de milliers

source: Scientific
fr_fr: Scientifique

source: Humanised
fr_fr: Non scientifique

source: Show/Hide Buttons
fr_fr: Voir/Cacher les boutons

source: Help Button
fr_fr: Bouton "Aide"

source: Show/Hide help button (you can always type "help" from input window).
fr_fr: Voir/cacher le bouton d'aide (Vous pourrez toujours taper "aide" depuis une fenêtre d'entrée).

source: Calculate Button
fr_fr: Bouton "Calculer"

source: Show/Hide Calculate button (you can always press enter at the end of input).
fr_fr: Voir/Cacher le bouton "Calculer" (Vous pouvez toujours presser sur la touche "Enter" à la fin de la dernière entrée).

source: Function Button
fr_fr: Bouton "Fonction"

source: History Settings
fr_fr: Réglage de l'historique

source: Max Results
fr_fr: Résultats maxi

source: More results use up more memory. Memory is only allocated if required (e.g. if number is 30000, corresponding memory will only be used after this many calculations).
fr_fr: Plus de résultats mobilise plus de mémoire. La mémoire est allouée seulement si nécessaire. (Par exemple, si le nombre est supérieur à 30000, la mémoire correspondante sera utilisée après ces nombreux calculs).

source: More results use more memory. Memory will be cleared if Max Results is reached. NB variables are kept
fr_fr: Plus de résultats nécessite plus de mémoire. La mémoire doit être vidée si plus de résultats sont obtenus. NB : les variables sont gardées

source: Opacity
fr_fr: Opacité
sv_se: Genomskinlighet

source: Show History Window
fr_fr: Voir la fenêtre de l'historique

source: Show/Hide history
fr_fr: Voir/cacher l'historique

source: Other
fr_fr: Autre

source: Log results to opencpn
fr_fr: Résultats dans les log d'OpenCPN

source: Log calculator results in OpenCPN log file
fr_fr: Les log des résultats de la calculatrice sont dans dans les log d'OpenCPN

source: Calculator Plugin for OpenCPN by SaltyPaws aka Walbert Schulpen/Updated by Mike Rossiter(Rasbats) ======================================= This is a light weight yet powerful calculator plugin for OpenCPN. Would you like to know your hull speed? Key features are: * Storing results in variables * Shows historic calculations * Full complement of nautical functions * Screen footprint can be optimised & minimised as required Adding formulas is easy. If your favorite nautical equation is missing, please let me know your equation via flyspray, and I will add it. Many formulas are based on U.S. units. Formulas use a 'base' unit, for example US Gallons per Minute. Conversion factors are used to display the result in other units. Using other units the result may not be exactly as expected. For example "Convert Flowrate": 10 m3/s converts to 599999.999365987 liter per minute, not 600000 exactly, using the 'precise' accuracy. Help ========= Type help in the calculator to get these instructions. Examples of expression that work in the calculator are: (comments are in brackets, some results depend on other example calculations): ========= Hull speed: LWL=48 (water line lenght in feet) vhull=1.34*LWL^(1/2) (hull speed in knots) Conversions: ftm=0.3048 (feet to meters) km_to_nm=0.539957 (Kilometers to nautical Mile) ftm*LWL (waterline length in meters) Distance to horizon R=6378.1*1000 (Radius of the earth in m) H=2.5 (Height of the eye above sea-level in m) d = R * acos(R/(R + h)) (Distance to horizon in m) ans*km_to_nm (Distance to horizon in nm) Distance to lighthouse H1=200 (height of lighthouse in m) d1 = R*acos(R/(R + H1)) (Distance to horizon in m) distance=d1+d (visibility range of lighthouse in m) Built-in functions The following table gives an overview of the functions supported by the default implementation. It lists the function names, the number of arguments and a brief description. Name Argc. Explanation sin 1 sine function cos 1 cosine function tan 1 tangens function asin 1 arcus sine function acos 1 arcus cosine function atan 1 arcus tangens function sinh 1 hyperbolic sine function cosh 1 hyperbolic cosine tanh 1 hyperbolic tangens function asinh 1 hyperbolic arcus sine function acosh 1 hyperbolic arcus tangens function atanh 1 hyperbolic arcur tangens function log2 1 logarithm to the base 2 log10 1 logarithm to the base 10 log 1 logarithm to the base 10 ln 1 logarithm to base e (2.71828...) exp 1 e raised to the power of x sqrt 1 square root of a value sign 1 sign function -1 if x<0; 1 if x>0 rint 1 round to nearest integer abs 1 absolute value min var. min of all arguments max var. max of all arguments sum var. sum of all arguments avg var. mean value of all arguments Built-in binary operators The following table lists the default binary operators supported by the parser. Operator Meaning Priority = assignment -1 && logical and 1 || logical or 2 <= less or equal 4 >= greater or equal 4 != not equal 4 == equal 4 > greater than 4 < less than 4 + addition 5 - subtraction 5 * multiplication 6 / division 6 ^ raise x to the power of y 7 *The assignment operator is special since it changes one of its arguments and can only by applied to variables. Other operators muParser has built in support for the if then else operator. It uses lazy evaluation in order to make sure only the necessary branch of the expression is evaluated. Operator Meaning Remarks ?: if then else operator C++ style syntax Variables: pi, e ans is the result of the previous calulation dtr is the conversion factor from degrees to radians you can define your own variables (e.g. myvariable=10/8*cos(dtr*90) or yourvariable=ans) clear removes results in the history, but leaves your defined variables in tact User Interface - type these commands in the command window: history - Toggle the history panel showhelp - Show/Hide the Help button showcalculate - Show/Hide the Calculate button showhistory - Show/Hide the history toggle help - show the help menu Settings/Plugins/Preferences: Show/Hide Function, Calculate and Help buttons History Settings: max Results -this is the number of results that will be stored in the history pulldown. The history pulldown will contain five times this value Log to opencpn: Enable/Disable logging of results to opencpn logfile. Calculate Button: Enter the expression in the input box: e.g. 4+2. Do NOT use the = sign. "Enter" or press "Calculate". If you are using "History" the results will appear there. If not the result will appear in the input box. If you make a mistake, press "C/CE" to clear the input box.
fr_fr: Calculateur Plugin pour OpenCPN de SaltyPaws alias Walbert Schulpen/Mis à jour par Mike Rossiter (Rasbats) ====================================== Il s'agit d'un complément, ayant les possibilités d'une calculatrice, léger et puissant pour OpenCPN. Un exemple : Vous pouvez connaître la vitesse de votre coque. Les principales fonctionnalités sont: * Stockage des résultats dans des variables * Affichage de l'historique des calculs * Présence d'un ensemble important de fonctions nautiques * La taille de la fenêtre peut agrandie ou réduite à la demande L'ajout de formules est simple. Si votre équation nautique préférée manque, merci de le faire savoir, via le flyspray, et ce sera ajouté. De nombreuses formules sont basées sur les unités américaines. Les formules utilisent une unité de base, par exemple le gallon américain par minute. Les facteurs de conversion sont utilisés pour afficher le résultat dans d'autres unités. En utilisant d'autres unités, le résultat peut ne pas être exactement comme prévu. Par exemple, "Convert Débit": 10 m3 / s, sera converti en 599999,999365987 litres par minute, et non 600 000 exactement, comme on doit s'y attendre. Aide ========= Tapez l’aide dans la calculatrice pour obtenir les instructions. Les exemples d’expression qui fonctionnent dans la calculatrice sont les suivants: (les commentaires sont entre crochets, certains résultats dépendent d’autres calculs à titre d’exemple): ======== Vitesse maximale: LWL = 48 (longueur de la conduite d’eau en pieds) vhull = 1,34 * LWL ^ (1/2) (vitesse de la coque en nœuds) Conversions: ftm = 0,3048 (pieds en mètres) km_to_nm = 0.539957 (kilomètres en milles marins) ftm * LWL (longueur de la ligne de flottaison en mètres) Distance à l'horizon R = 6378.1 * 1000 (Rayon de la terre en m) H = 2,5 (Hauteur de l’œil au-dessus du niveau de la mer en m) d = R * acos (R / (R + h)) (distance à l’horizon en m) ans * km_to_nm (distance à l’horizon en nm) Distance au phare H1 = 200 (hauteur du phare en m) d1 = R * acos (R / (R + H1)) (distance à l’horizon en m) distance = d1 + d (plage de visibilité du phare dans M) Fonctions intégrées Le tableau ci-dessous donne un aperçu des fonctions prises en charge par l’implémentation par défaut. Il répertorie les noms de fonction, le nombre d’arguments et une brève description. Nom Nbre d'Arg. Explication sin 1 fonction sinus cos 1 fonction cosinus tan 1 fonction tangente asin 1 fonction arc sinus acos 1 fonction arc cosinus atan 1 fonction arc tangente sinh 1 fonction sinus hyperbolique cosh 1 fonction cosinus hyperbolique tanh 1 fonction tangente hyperbolique asinh 1 fonction arc sinus hyperbolique acosh 1 fonction arc cosinus hyperbolique atanh 1 fonction arc tangente hyperbolique log 2 1 logarithm base 2 log10 1 logarithm base 10 log 1 logarithm base 10 ln 1 logarithm base e (2.71828 ...) exp 1 Exp x sqrt 1 Racine carrée d'une valeur sign 1 sign fonction -1 si x <0; 1 si x> 0 rint 1 Arrondi à l'entier le plus proche abs 1 Valeur absolue min min de tous les arguments max max de tous les arguments sum Somme de tous les arguments avg Moyenne des valeurs de tous les arguments Opérateurs binaires intégrés Le tableau ci-dessous répertorie les opérateurs binaires par défaut pris en charge par l'analyseur. Opérateur Signification Priorité = Assignation -1 && Et logique 1 || Ou logique 2 <= Inférieur ou égal 4 >= Supérieur ou égal 4 != Différent de 4 == Egal à 4 > Plus grand que 4 < Plus petit que 4 + Somme 5 - Soustraction 5 * Multiplication 6 / Division 6 ^ x puissance y 7 * L'opérateur d'affectation est spécial car il modifie l'un de ses arguments et ne peut être appliqué qu'à des variables. Autres opérateurs muParser dispose d’un support intégré pour l’opérateur "if then else". Il utilise une évaluation lente afin de s’assurer que seule la branche nécessaire de l’expression est évaluée. Operateur Signification Remarques ?: Opérateur "if then else" C ++ Syntaxe de style Variable: pi, e ans est le résultat du calcul précédent dtr est le facteur de conversion de degrés en radians vous pouvez définir vos propres variables (par exemple, mavariable = 10/8 * cos (dtr * 90) ou votrevariable = ans) clear supprime les résultats de l'historique, mais conserve vos variables définies dans tact Interface utilisateur - tapez ces commandes dans la fenêtre de commande: Historique - Basculez le panneau de l'historique showhelp - Voir/Cacher le bouton Aide showcalculate - Voir/masquer le bouton Calculer Historique - Voir/masquer l'historique Aide - Voir le menu d'aide Options / Compléments / Préférences : Voir / Boutons "Masquer les fonctions", "Calculer" et "Aide" Paramètres de l’historique: Résultats max. Il s’agit du nombre de résultats qui seront stockés dans l’affichage déroulant de l’historique. La liste déroulante d'historique contiendra cinq fois cette valeur. Connectez-vous à OpenCPN: Activez / Désactivez la journalisation des résultats dans le fichier journal ouvert. Bouton Calculer: Entrez l'expression dans la zone de saisie: par exemple. 4 + 2. N'utilisez PAS le signe =. Utilisez la touche "Entrée" ou appuyez sur "Calculer". Si vous utilisez "Historique", les résultats y apparaîtront. Sinon, le résultat apparaîtra dans la zone de saisie. Si vous faites une erreur, appuyez sur "Calculer" pour effacer la zone de saisie.

source: W
fr_fr: O

source: Convert
fr_fr: Convertir

source: Close
fr_fr: Fermer

source: Select Function Category
fr_fr: Sélectionner la catégorie de la fonction

source: Select Function
fr_fr: Sélectionner la fonction

source: Function And Description
fr_fr: Fonction et description

source: Input Parameters
fr_fr: Paramètres d'entrée

source: Parameter
fr_fr: Paramètre

source: Function Result Select Units
fr_fr: Sélectionner les unités des résultats de la fonction

source: Hull Speed
fr_fr: Vitesse de la coque

source: Hull speed, sometimes referred to as displacement speed, can be thought of the speed at which the wavelength of the boats bow wave (in displacement mode) is equal to the boat length. As boat speed increases, the size of the bow wave increases, and therefore so does its wavelength. When hull speed is reached, a boat in pure displacement mode will appear trapped in a trough behind its very large bow wave.
fr_fr: La vitesse de la coque, parfois appelée vitesse de déplacement, peut être considérée comme la vitesse à laquelle la longueur d'onde du bateau est égale à la longueur du bateau. Comme la vitesse du bateau augmente, la taille de l'arc de l'onde augmente, et donc sa longueur d'onde aussi. Quand la vitesse de coque est atteinte, un bateau, en déplacement, pourra paraître pris au piège dans une trou derrière l'arc de sa vague.

source: Design
fr_fr: Apparence

source: Draft of vessel when heeled
fr_fr: Tirant d'eau du bateau s'il gite

source: Speed of wind-driven current
fr_fr: Vitesse du courant due au vent

source: Maximum Wavelength
fr_fr: Longueur d’onde maximale

source: Wave speed = 3.03 x (wave period in seconds) NB output units need to be confirmed
fr_fr: Vitesse de vague = 3.03 x (période d'onde en secondes). N.B. Les unités de sortie doivent être confirmées

source: Change in height of Tide
fr_fr: Connaître la hauteur d'eau de la marée

source: Height is total change in tide height between high and low. The time ratio is time elapsed from the previous tide divided by the time difference between the two tides. (Similar to rule of 12)
fr_fr: Le marnage est la différence entre les hauteurs d'eau des marées haute et basse. Le ratio de temps est la durée écoulée depuis la marée précédente divisée par la durée entre deux marées. (Similaire à la règle du 12ème)

source: Not very accurate - use official publications
fr_fr: Pas très précis - utilisez les publications officielles

source: Fetch Modified Wilson
fr_fr: Fetch modifié Wilson

source: Calculate Fetch as function of windspeed at 10 meters height (u10) and Fetch. The equation is based on the wilson equation (1965), but modified by Naoto for increased accuracy.
fr_fr: Calculer le Fetch en fonction du vent à 10 mètres de hauteur (U10). L'équation est basée sur l'équation de Saumon (1965), équation modifiée par Naoto pour une précision accrue.

source: Flow rate of leak in boat
fr_fr: Débit d'entrée d'eau en cas d'avarie

source: Flow rate of leak in boat: Q = 7.48*A*(2gH)^0.5 Q = volume per minute of water coming in A = area of hole H = height of water over hole, to bottom of the opening
fr_fr: Débit d'entrée d'eau si avarie : Q = 7.48*A*(2gH)^0.5 Q = Volume d'eau entrant par minute A = Surface du trou H = Hauteur entre le trou et la surface de l'eau

source: Safety
fr_fr: Sécurité

source: Patch over hole
fr_fr: Pièce sur le trou

source: Patch or cover thickness to withstand water pressure (patch over hole): T = square root of: (48x (H) (L2))/ 1000) T = thickness of wood or plywood patch H = height of water above bottom of hole L = length of patch, longest distance between supports
fr_fr: Epaisseur de la pièce sur le trou ou du couvercle pour résister à la pression de l'eau : T = Racine carrée de : (48x (H) (L2)) / 1000) T = Epaisseur de la plaque de bois ou de contreplaqué H = Hauteur de l'eau au-dessus du fond du trou L = longueur de la pièce, distance maximale entre les supports

source: Line Break strength (circumference)
fr_fr: Force de rupture de la ligne (Circonférence)

source: Each type of line, natural fiber, synthetic and wire rope, have different breaking strengths and safe working loads. Natural breaking strength of manila line is the standard against which other lines are compared. Synthetic lines have been assigned comparison factors against which they are compared to manila line. The basic breaking strength factor for manila line is found by multiplying the square of the circumference of the line by 900 lbs. Knots and splices only have 50-60 percent of line strength. Line Material Comparison Factor Nylon 2.5 Dacron 2.0 Polypropylene 1.4 Manilla 1.0
fr_fr: Chaque type de ligne, fibre naturelle, synthétique ou câble métallique, présente une résistance à la rupture et une charge de travail différente. La résistance à la rupture naturelle d'une ligne de manilles est la norme à laquelle les autres lignes sont comparées. Les lignes synthétiques ont été associées à des facteurs de comparaison auxquels sont comparées la ligne de manille. Le facteur de base de résistance à la rupture pour la ligne de manilles est obtenu en multipliant le carré de la circonférence de la ligne par 900 livres. Les nœuds et les épissures ont seulement 50 à 60% de la force de la ligne.. Lignes de référence Facteur de comparaison Nylon 2.5 Dacron 2.0 Polypropylène 1.4 Manille 1.0

source: Line Break strength (diameter)
fr_fr: Force de rupture de la ligne (diamètre)

source: Each type of line, natural fiber, synthetic and wire rope, have different breaking strengths and safe working loads. Natural breaking strength of manila line is the standard against which other lines are compared. Synthetic lines have been assigned comparison factors against which they are compared to manila line. The basic breaking strength factor for manila line is found by multiplying the square of the circumference of the line by 900 lbs. Knots and splices only have 50-60 of line strenght. Line Material Comparison Factor Nylon 2.5 Dacron 2.0 Polypropylene 1.4 Manilla 1.0
fr_fr: Chaque type de ligne, fibre naturelle, synthétique ou câble métallique, présente une résistance à la rupture et une charge de travail différente. La résistance à la rupture naturelle d'une ligne de manilles est la norme à laquelle les autres lignes sont comparées. Les lignes synthétiques ont été associées à des facteurs de comparaison auxquels sont comparées la ligne de manille. Le facteur de base de résistance à la rupture pour la ligne de manilles est obtenu en multipliant le carré de la circonférence de la ligne par 900 livres. Les noeuds et les épissures n’ont que 50 à 60 lignes. Lignes de référence Facteur de comparaison Nylon 2.5 Dacron 2.0 Polypropylène 1.4 Manille 1.0

source: Velocity Made Good (angle)
fr_fr: Vitesse made good (angle)

source: Velocity made good, or vmg, is a term in sailing, and specifically yacht racing, that refers to the component of a sailboats velocity that is in the direction of the true wind. The concept is useful in sailing, because a sailboat often cannot, or should not, sail directly to a mark to reach the mark as quickly as possible. Sailboats cannot sail directly upwind, and it is usually less than optimal, and sometimes dangerous, to sail directly downwind. Instead of sailing toward the mark, the helmsman chooses a point of sail that optimizes velocity made good.
fr_fr: Vitesse made good, ou vmg, est un terme utilisé en voile, et plus précisément en régate, qui fait référence à la composante de la vitesse d'un voilier qui se trouve dans la direction du vent réel. Le concept est utile en navigation, car un voilier ne peut souvent pas, ou ne devrait pas, se rendre directement à une marque pour l'atteindre le plus rapidement possible. Les voiliers ne peuvent pas naviguer face au vent et il est généralement moins optimal et parfois dangereux de naviguer directement au plus près du vent. Au lieu de naviguer vers la marque, le barreur choisit un point de navigation optimisant la vitesse.

source: https://en.wikipedia.org/wiki/Velocity_made_good
fr_fr: https://fr.wikipedia.org/wiki/Velocity_made_good

source: Wind Chill
fr_fr: Indice de Refroidissement Eolien

source: In November 2001 Canada, U.S. and U.K. implemented a new wind chill index developed by scientists and medical experts on the Joint Action Group for Temperature Indices (JAG/TI). It is determined by iterating a model of skin temperature under various wind speeds and temperatures using standard engineering correlations of wind speed and heat transfer rate. Heat transfer was calculated for a bare face in wind, facing the wind, while walking into it at 1.4 metre per second (3.1mph). The model corrects the officially measured wind speed (at 10 meter height) to the wind speed at face height, assuming the person is in an open field. The results of this model may be approximated, to within one degree, from the following formula:
fr_fr: En novembre 2001, le Canada, les États-Unis et le Royaume-Uni ont mis en place un nouvel indice de refroidissement éolien, mis au point par des scientifiques et des experts médicaux au sein du groupe d’action commune pour les indices de température (JAG / TI). Il est déterminé en itérant un modèle de température de la peau sous différentes vitesses de vent et températures en utilisant des corrélations techniques standard de la vitesse du vent et du taux de transfert de chaleur. Le transfert de chaleur a été calculé, pour un visage nu faisant face au vent, en y pénétrant à 1,4 mètre par seconde (3.1 mph). Le modèle corrige la vitesse du vent officiellement mesurée (à 10 mètres de hauteur) en fonction de la vitesse du vent à la hauteur du visage, en supposant que la personne se trouve dans un champ ouvert. Les résultats de ce modèle peuvent être approximés, à un degré près, par la formule suivante :

source: Weather
fr_fr: Météo
